Configuration/InformationRegisters/НаличиеДанныхВУзлахКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НаличиеДанныхВУзлахКОД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ИдентификаторКлюча</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипКлюча</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыКОД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/Catalogs/Файлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Файлы</Name>
			<Comment>Файлы в папках</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор - пользователь, добавивший файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецФайла</Name>
					<Comment>Владелец файла</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецФайлов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаема</Name>
					<Comment>Дата заема на редактирование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Comment>Дата добавления файла в базу</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зашифрован</Name>
					<Comment>Файл зашифрован</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексКартинки</Name>
					<Comment>Индекс иконки, соответствующей расширению файла, для показа в списке</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеУдалятьСтарыеВерсии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание файла</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодписанЭП</Name>
					<Comment>Файл подписан ЭП</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Comment>Полное наименование (длиной до 256 символов)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Редактирует</Name>
					<Comment>Пользователь, занявший файл для редактирования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтратегияРаспознавания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтратегииРаспознаванияТекста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсия</Name>
					<Comment>Активная версия</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВерсииФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияАвтор</Name>
					<Comment>Автор - пользователь, создавший версию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияДатаМодификацииФайла</Name>
					<Comment>Дата модификации файла - в локальном времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияДатаСоздания</Name>
					<Comment>Дата создания версии</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияКод</Name>
					<Comment>Текущая версия код</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияНомерВерсии</Name>
					<Comment>Номер версии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияПутьКФайлу</Name>
					<Comment>Дополнительный путь к файлу на диске (в случае если тип хранения файла - на диске)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияРазмер</Name>
					<Comment>Размер файла версии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияРасширение</Name>
					<Comment>Расширение файла версии</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяВерсияТом</Name>
					<Comment>Ссылка на том (в случае если ТипХраненияФайла - на диске)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТомаХраненияФайлов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьТекстХранилище</Name>
					<Comment>Текст, извлеченный из файла - для полнотекстового поиска   в 3.0.10 переименовано</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьВерсии</Name>
					<Comment>Хранить версии - если Ложь, у файла всегда одна версия - активная</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонОснованиеДляСоздания</Name>
					<Comment>Шаблон файла, на основании которого был создан данный файл</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯзыкРаспознавания</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СубъектыПерсональныхДанных</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/CommonModules/РаботаСФайламиХолдинг/Ext/Module.bsl
// @strict-types

#Область ПрограммныйИнтерфейс

// Выполняется при определении узлов самостоятельных данных, в которые они ранее отправлялись.
// Вызывается из КОДОтправка.ДобавитьДляСамостоятельныхДанныхУзлыВКоторыхОниЕсть.
//
// Параметры:
//	ТипДанныхОбмена - Структура - Описание типа данных КОД (см. КОДПовтИсп.ИдентификаторИТипыДанныхОбмена):
//		* ПолноеИмя - Строка - Полное имя объекта метаданных
//		* ИдентификаторОбъектаМетаданных - СправочникСсылка.ИдентификаторыОбъектовМетаданных - Идентификатор типа.
//	КлючиДанных - Массив Из ЛюбаяСсылка - Ключи объектов.
//	ПараметрыРассмотрения - Структура:
//		* ВсеУзлыАдресаты - Соответствие из КлючИЗначение -
//	УзлыДанных - Соответствие Из КлючИЗначение - Неявно возвращаемый параметр, в который следует поместить результат.
//	СтандартнаяОбработка - Булево - Признак отключения стандартной логики.
//
Процедура ПриОпределенииУзловСамостоятельныхДанныхВКоторыхОниЕсть(
			ТипДанныхОбмена, КлючиДанных, ПараметрыРассмотрения, УзлыДанных, СтандартнаяОбработка) Экспорт
	
	Если ТипДанныхОбмена.ПолноеИмя = "Справочник.ТомаХраненияФайлов"
			Или ТипДанныхОбмена.ПолноеИмя = "Справочник.ПравилаРазмещенияФайловВТомах" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		КлючиОтметокВремени = Новый ТаблицаЗначений;
		КлючиОтметокВремени.Колонки.Добавить("ИдентификаторКлюча", Новый ОписаниеТипов("УникальныйИдентификатор"));
		КлючиОтметокВремени.Колонки.Добавить("ТипКлюча", КОДСервер.ОписаниеТиповИдентификаторовОбъектовМетаданных());
		КлючиОтметокВремени.Колонки.Добавить("Объект", КОДСервер.ОписаниеТиповИдентификаторовОбъектовМетаданных());
		
		Для Каждого КлючДанных Из КлючиДанных Цикл // ЛюбаяСсылка
			КлючОтметокВремени = КОДСервер.КлючДанныхВФорматКлючаОтметокВремени(
				КлючДанных, ТипДанныхОбмена.ИдентификаторОбъектаМетаданных);
			
			СтрокаТаблицы = КлючиОтметокВремени.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаТаблицы, КлючОтметокВремени);
			СтрокаТаблицы.Объект = ТипДанныхОбмена.ИдентификаторОбъектаМетаданных; //@skip-check property-return-type
		КонецЦикла;
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	КлючиДанных.ИдентификаторКлюча КАК ИдентификаторКлюча,
			|	КлючиДанных.ТипКлюча КАК ТипКлюча,
			|	КлючиДанных.Объект КАК Объект
			|ПОМЕСТИТЬ КлючиДанных
			|ИЗ
			|	&КлючиДанных КАК КлючиДанных
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	НаличиеДанныхВУзлахКОД.ИдентификаторКлюча КАК ИдентификаторКлюча,
			|	НаличиеДанныхВУзлахКОД.ТипКлюча КАК ТипКлюча,
			|	НаличиеДанныхВУзлахКОД.Объект КАК Объект,
			|	НаличиеДанныхВУзлахКОД.Узел КАК Узел
			|ИЗ
			|	КлючиДанных КАК КлючиДанных
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НаличиеДанныхВУзлахКОД КАК НаличиеДанныхВУзлахКОД
			|		ПО КлючиДанных.ИдентификаторКлюча = НаличиеДанныхВУзлахКОД.ИдентификаторКлюча
			|			И КлючиДанных.ТипКлюча = НаличиеДанныхВУзлахКОД.ТипКлюча
			|			И КлючиДанных.Объект = НаличиеДанныхВУзлахКОД.Объект
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УзлыКОД КАК УзлыКОД
			|		ПО (НаличиеДанныхВУзлахКОД.Узел = УзлыКОД.Ссылка)
			|			И (НЕ УзлыКОД.СобственноеФайловоеХранилище)
			|			И (НЕ УзлыКОД.ПометкаУдаления)");
		Запрос.УстановитьПараметр("КлючиДанных", КлючиОтметокВремени);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ПараметрыРассмотрения.ВсеУзлыАдресаты[Выборка.Узел] = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			КлючДанных = КОДСервер.КлючОтметокВремениВФорматКлючаДанных(
				Выборка.ИдентификаторКлюча, Выборка.ТипКлюча, Выборка.Объект);
			
			УзлыКлючаДанных = УзлыДанных[КлючДанных]; // Массив Из СправочникСсылка.УзлыКОД
			УзлыКлючаДанных.Добавить(Выборка.Узел);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при рассмотрении изменений и позволяет переопределить стандартное рассмотрение.
//
// Параметры:
//	СтандартнаяОбработка - Булево - Признак стандартной обработки.
//	ТипДанных - Структура:
//		* ПолноеИмя - Строка - Полное имя типа данных обмена.
//	Изменения - см. ОтметкиВремени.ВыбратьИзменения.
//	ИзмененияДляАдресатов - Массив Из Структура:
//		* Изменения - Соответствие Из КлючИЗначение:
//			* Ключ - СправочникСсылка.ИдентификаторыОбъектовМетаданных - Тип отправляемых данных.
//			* Значение - см. ОтметкиВремени.ВыбратьИзменения.
//		* КлючиИАдресаты - Соответствие Из КлючИЗначение - Соответствие ключей отправляемых данных адресатам.
//		* КоличествоКластеров - СправочникСсылка.УзлыКОД
//
Процедура ПриРассмотренииИзменений(СтандартнаяОбработка, ТипДанных, Изменения, ИзмененияДляАдресатов) Экспорт
	
	Если ТипДанных.ПолноеИмя = "Справочник.ТомаХраненияФайлов" И КОДПовтИсп.ЭтоПодчиненныйУзел() Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
	Если ТипДанных.ПолноеИмя = "Справочник.ПравилаРазмещенияФайловВТомах" И КОДПовтИсп.ЭтоПодчиненныйУзел() Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

// Выполняется при определении адресатов самостоятельных данных для определения особого алгоритма.
//
// Параметры:
//   ТипДанныхОбмена - Структура - Описание типа данных КОД (см. КОДПовтИсп.ИдентификаторИТипыДанныхОбмена):
//     * ПолноеИмя - Строка - Полное имя объекта метаданных
//   КлючиДанных - Массив Из СправочникСсылка, ДокументСсылка - Ключи объектов, которые требуют определения адресатов.
//   ПараметрыРассмотрения - Структура
//   УзлыДанных - Соответствие Из КлючИЗначение - Неявно возвращаемый параметр, в него следует поместить результат.
//   СтандартнаяОбработка - Булево - Признак отключения стандартной логики определения адресатов.
//
Процедура ПриОпределенииАдресатовСамостоятельныхДанных(ТипДанныхОбмена, КлючиДанных, ПараметрыРассмотрения,
		УзлыДанных, СтандартнаяОбработка) Экспорт
	
	Если ТипДанныхОбмена.ПолноеИмя = "Справочник.Файлы" Тогда
		
		УзлыДанных = АдресатыФайлов(КлючиДанных);
		СтандартнаяОбработка = Ложь;
		
	ИначеЕсли ТипДанныхОбмена.ПолноеИмя = "Справочник.ТомаХраненияФайлов"
			Или ТипДанныхОбмена.ПолноеИмя = "Справочник.ПравилаРазмещенияФайловВТомах" Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ТаблицаКлючей.Ссылка КАК Ключ,
			|	УзлыКОД.Ссылка КАК Узел
			|ИЗ
			|	#ТаблицаКлючей КАК ТаблицаКлючей
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УзлыКОД КАК УзлыКОД
			|		ПО НЕ УзлыКОД.СобственноеФайловоеХранилище
			|			И НЕ УзлыКОД.ПометкаУдаления
			|			И НЕ УзлыКОД.Ссылка = ЗНАЧЕНИЕ(Справочник.УзлыКОД.ЭтотУзел)
			|ГДЕ
			|	ТаблицаКлючей.Ссылка В (&КлючиДанных)");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "#ТаблицаКлючей", ТипДанныхОбмена.ПолноеИмя);
		Запрос.УстановитьПараметр("КлючиДанных", КлючиДанных);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			//@skip-check property-return-type
			Ключ = Выборка.Ключ; // СправочникСсылка.ТомаХраненияФайлов
			
			УзлыКлюча = УзлыДанных[Ключ]; // Массив Из СправочникСсылка.УзлыКОД
			Если УзлыКлюча = Неопределено Тогда
				УзлыДанных[Ключ] = Новый Массив;
				УзлыКлюча = УзлыДанных[Ключ];
			КонецЕсли;
			УзлыКлюча.Добавить(Выборка.Узел);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Вызывается перед записью прочитанных данных из объекта XDTO. Позволяет переопределить стандартную
// обработку записи данных в ИБ.
//
// Параметры:
//	Данные - Произвольный - Объект, который необходимо записать.
//	ЧтениеСообщения - см. КОДПолучение.НовоеЧтениеСообщения.
//	СтандартнаяОбработка - Булево - Неявно возвращаемое значение, Ложь - если стандартная обработка не требуется.
//
Процедура ПередЗаписьюПрочтенногоИзСообщенияКОД(Данные, ЧтениеСообщения, СтандартнаяОбработка) Экспорт
	
	Если ТипЗнч(Данные) = Тип("СправочникОбъект.ТомаХраненияФайлов")
			Или ТипЗнч(Данные) = Тип("СправочникОбъект.ПравилаРазмещенияФайловВТомах") Тогда
		
		Если КОДПовтИсп.УзелИспользуетСобственноеФайловоеХранилище()
				И Данные.УзелОбработки <> КОДПовтИсп.ИдентификаторТекущегоУзла() Тогда
			
			Данные.ПометкаУдаления = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗнч(Данные) = Тип("СправочникОбъект.ВерсииФайлов") Тогда
		
		РеквизитыОбъекта =
			"Автор, ДатаМодификацииФайла, ДатаСоздания, ИндексКартинки, Размер,
			|Расширение, Код, НомерВерсии, ПутьКФайлу, Том";
		
		Изменения = Новый Структура(РеквизитыОбъекта);
		ЗаполнитьЗначенияСвойств(Изменения, Данные);
		
		КОДПолучение.ДобавитьДанныеДляОбработкиПриЗавершенииЧтенияСообщения(
			ЧтениеСообщения, ТипЗнч(Данные), КОДПолучение.КлючСсылочныхДанных(Данные), Данные, Изменения);
	
	КонецЕсли;
	
КонецПроцедуры

// Вызывается при завершении чтения сообщения КОД, если тип присутствует в данных для постобработки.
// Позволяет выполнить постобработку загруженных данных или отложить ее до обработки данных других
// типов, результаты обработки которых требуются для обработки этого.
//
// Параметры:
//	ТипДанных - Тип - Тип, который подлежит постобработке.
//	ДанныеДляПостобработки - ТаблицаЗначений:
//		* ЗначениеДанных - СправочникОбъект.Файлы
//		* Изменения - Структура:
//			** Автор - СправочникСсылка.Сотрудники
//			** ДатаМодификацииФайла - Дата
//			** ДатаСоздания - Дата
//			** ИндексКартинки - Число
//			** Размер - Число
//			** Расширение - Строка
//			** Код - Строка
//			** НомерВерсии - Число
//			** ПутьКФайлу - Строка
//			** Том - СправочникСсылка.ТомаХраненияФайлов
//	ТипОбработан - Булево - Истина, если обработка данных этого типа завершена, и Ложь, если обработка
//							отложена и требуется повторный вызов после обработки данных других типов.
//	ТипыДанныхДляПостобработки - Соответствие Из КлючИЗначение - Типы данных, подлежащих постобработке,
//																 но еще не обработанные.
//	ЧтениеСообщения - см. КОДПолучение.НовоеЧтениеСообщения
//
Процедура ПриЗавершенииЧтенияСообщенияКОД(
		ТипДанных, ДанныеДляПостобработки, ТипОбработан, ТипыДанныхДляПостобработки, ЧтениеСообщения = Неопределено) Экспорт
	
	Если ТипДанных = Тип("СправочникОбъект.ВерсииФайлов") Тогда
		
		Для Каждого СтрокаДанных Из ДанныеДляПостобработки Цикл
			Файл = СтрокаДанных.ЗначениеДанных.Владелец; // СправочникСсылка.Файлы
			
			РеквизитыФайла = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
				Файл,
				"ТекущаяВерсия, ИндексКартинки, ТекущаяВерсияРазмер, ТекущаяВерсияДатаСоздания, ТекущаяВерсияАвтор,
				|ТекущаяВерсияРасширение, ТекущаяВерсияНомерВерсии, ТекущаяВерсияТом, ТекущаяВерсияПутьКФайлу,
				|ТекущаяВерсияКод, ТекущаяВерсияДатаМодификацииФайла");
			
			Если РеквизитыФайла.ТекущаяВерсия = СтрокаДанных.ЗначениеДанных.Ссылка 
				И (РеквизитыФайла.ТекущаяВерсияРазмер <> СтрокаДанных.Изменения.Размер 
					ИЛИ РеквизитыФайла.ТекущаяВерсияДатаСоздания <> СтрокаДанных.Изменения.ДатаСоздания
					ИЛИ РеквизитыФайла.ТекущаяВерсияРасширение <> СтрокаДанных.Изменения.Расширение
					ИЛИ РеквизитыФайла.ТекущаяВерсияНомерВерсии <> СтрокаДанных.Изменения.НомерВерсии
					ИЛИ РеквизитыФайла.ТекущаяВерсияТом <> СтрокаДанных.Изменения.Том
					ИЛИ РеквизитыФайла.ТекущаяВерсияПутьКФайлу <> СтрокаДанных.Изменения.ПутьКФайлу 
					ИЛИ РеквизитыФайла.ТекущаяВерсияКод <> СтрокаДанных.Изменения.Код
					ИЛИ РеквизитыФайла.ИндексКартинки <> СтрокаДанных.Изменения.ИндексКартинки
					ИЛИ РеквизитыФайла.ТекущаяВерсияДатаМодификацииФайла
						<> СтрокаДанных.Изменения.ДатаМодификацииФайла) Тогда
				
				ФайлОбъект = Файл.ПолучитьОбъект();
				
				ФайлОбъект.ИндексКартинки = СтрокаДанных.Изменения.ИндексКартинки;
				ФайлОбъект.ТекущаяВерсияРазмер = СтрокаДанных.Изменения.Размер;
				ФайлОбъект.ТекущаяВерсияДатаСоздания = СтрокаДанных.Изменения.ДатаСоздания;
				ФайлОбъект.ТекущаяВерсияАвтор = СтрокаДанных.Изменения.Автор;
				ФайлОбъект.ТекущаяВерсияРасширение = СтрокаДанных.Изменения.Расширение;
				ФайлОбъект.ТекущаяВерсияНомерВерсии = СтрокаДанных.Изменения.НомерВерсии;
				ФайлОбъект.ТекущаяВерсияТом = СтрокаДанных.Изменения.Том;
				ФайлОбъект.ТекущаяВерсияПутьКФайлу = СтрокаДанных.Изменения.ПутьКФайлу;
				ФайлОбъект.ТекущаяВерсияКод = СтрокаДанных.Изменения.Код;
				ФайлОбъект.ТекущаяВерсияДатаМодификацииФайла = СтрокаДанных.Изменения.ДатаМодификацииФайла;
				
				ОбновлениеИнформационнойБазыДокументооборот.ЗаписатьДанные(ФайлОбъект);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Узлы адресаты файлов.
// 
// Параметры:
//  Файлы - Массив Из СправочникСсылка.Файлы
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
//    * Ключ - СправочникСсылка.Файлы
//    * Значение - Массив Из СправочникСсылка.УзлыКОД
//
Функция АдресатыФайлов(Файлы) Экспорт
	
	УзлыФайлов = КОДСервер.УзлыСамостоятельныхДанныхПоПравам(Файлы);
	
	ДополнитьАдресатовПоДокументамДО(УзлыФайлов);
	
	Возврат УзлыФайлов;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Вызывается перед записью тома хранения файлов.
//
// Параметры:
//	Объект - СправочникОбъект.ТомаХраненияФайлов - Том.
//
Процедура ПередЗаписьюТомаХраненияФайлов(Объект) Экспорт
	
	Если КОДСервер.ЭтоЦентральныйУзел() Тогда
		Возврат;
	КонецЕсли;
	
	Если Не КОДПовтИсп.УзелИспользуетСобственноеФайловоеХранилище() Тогда
		ТекстСообщения =
			Нстр("ru = 'Добавление и изменение томов хранения файлов доступно только в узлах с включенной настройкой ""Собственные тома хранения файлов"".'");
		
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Дополняет адресатов файлов адресатами владеющих их документов ДО
// 
// Параметры:
//  УзлыФайлов - Соответствие Из КлючИЗначение:
//    * Ключ - СправочникСсылка.Файлы
//    * Значение - Массив Из СправочникСсылка.УзлыКОД
Процедура ДополнитьАдресатовПоДокументамДО(УзлыФайлов)
	
	Файлы = Новый Массив();
	Для Каждого Элемент Из УзлыФайлов Цикл
		Файл = Элемент.Ключ;
		Файлы.Добавить(Файл);
	КонецЦикла;
	
	ДокументыПоФайлам = ФайлыДокументовИДокументы(Файлы);
	
	ДокументыДО = Новый Массив();
	Для Каждого Элемент Из ДокументыПоФайлам Цикл
		Документ = Элемент.Значение;
		ДокументыДО.Добавить(Документ);
	КонецЦикла;
	ДокументыДО = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ДокументыДО);
	
	ПараметрыОпределенияАдресатовДокументов = ДелопроизводствоХолдинг.НовыеПараметрыОпределенияАдресатовДокументов();
	УзлыДокументов = ДелопроизводствоХолдинг.АдресатыДокументов(ДокументыДО, ПараметрыОпределенияАдресатовДокументов);
	
	Для Каждого Элемент Из ДокументыПоФайлам Цикл
		
		Файл = Элемент.Ключ;
		Документ = Элемент.Значение;
		
		УзлыФайла = УзлыФайлов[Файл];
		Если УзлыФайла = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		УзлыДокумента = УзлыДокументов[Документ];
		Если УзлыДокумента = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(УзлыФайла, УзлыДокумента, Истина);
		
	КонецЦикла;
	
КонецПроцедуры

// Из переданного массива файлов выбирает файлы, которые принадлежат документам ДО
//  и помещает их в соответствие с Документами ДО
// 
// Параметры:
//  Файлы - Массив Из СправочникСсылка.Файлы
// 
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение:
//    * Ключ - СправочникСсылка.Файлы
//    * Значение - СправочникСсылка.ДокументыПредприятия
//
Функция ФайлыДокументовИДокументы(Файлы)
	
	РеквизитыФайлов = ОбщегоНазначения.ЗначенияРеквизитовОбъектов(Файлы, "ВладелецФайла");
	
	ДокументыФайлов = Новый Соответствие();
	
	Для Каждого Файл Из Файлы Цикл
		
		РеквизитыФайла = РеквизитыФайлов[Файл];
		
		Если РеквизитыФайла = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если ТипЗнч(РеквизитыФайла.ВладелецФайла) <> Тип("СправочникСсылка.ДокументыПредприятия") Тогда
			Продолжить;
		КонецЕсли;
		
		ДокументыФайлов[Файл] = РеквизитыФайла.ВладелецФайла;
		
	КонецЦикла;
	
	Возврат ДокументыФайлов;
	
КонецФункции

#КонецОбласти
